public_html/Embedded-System/kernel/Linux-Kernel-Build.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Linux Kernel Build</title>
<!-- 2014-10-29 Wed 22:50 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Linux Kernel Build</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Make kernel</a>
<ul>
<li><a href="#sec-1-1">clean</a></li>
<li><a href="#sec-1-2">make</a></li>
<li><a href="#sec-1-3">Auto detection of Kernel Load Address and Run Time RAM Base Determination</a></li>
</ul>
</li>
<li><a href="#sec-2">FAQ</a>
<ul>
<li><a href="#sec-2-1">Build the kernel 2.6.38, but the name become "linux-2.6.38+". How can I prevent the + symbol from being prefixed to the kernel image name?</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Make kernel</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">clean</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-sh">make mrproper
make clean
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">make</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-sh"> make <span style="color: #eedd82;">CROSS_COMPILE</span>=arm-none-linux-gnueabi- <span style="color: #eedd82;">ARCH</span>=arm ti8168_evm_defconfig
To view configuration interactively:
 make <span style="color: #eedd82;">CROSS_COMPILE</span>=arm-none-linux-gnueabi- <span style="color: #eedd82;">ARCH</span>=arm menuconfig
 make <span style="color: #eedd82;">CROSS_COMPILE</span>=arm-none-linux-gnueabi- <span style="color: #eedd82;">ARCH</span>=arm uImage
 make <span style="color: #eedd82;">CROSS_COMPILE</span>=arm-none-linux-gnueabi- <span style="color: #eedd82;">ARCH</span>=arm modules
 make <span style="color: #eedd82;">CROSS_COMPILE</span>=arm-none-linux-gnueabi- <span style="color: #eedd82;">ARCH</span>=arm <span style="color: #eedd82;">INSTALL_MOD_PATH</span>=/home/testbed/targetfs  modules_install
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Auto detection of Kernel Load Address and Run Time RAM Base Determination</h3>
<div class="outline-text-3" id="text-1-3">
<p>
By default, the DM81xx kernel is built to be loaded at physical
address 0x80008000 in RAM and take start of RAM as 0x80000000.
</p>

<p>
It is possible to load the kernel at a different location in RAM with kernel automatically determining RAM base
depending upon the load address.
This is achieved by the combination of two features added the kernel:
</p>
<ol class="org-ol">
<li>Run time PHYS<sub>OFFSET</sub> determination: This feature enables determining physical to virtual translations
</li>
</ol>
<p>
dynamically depending upon the position of kernel in system memory.
</p>
<ol class="org-ol">
<li>Auto calculation of address for uncompressed kernel: This feature enables the compressed kernel entry code (part
</li>
</ol>
<p>
of kernel zImage) to determine the address to uncompress the kernel depending upon the location it is loaded
(started from).
</p>
</div>

<ul class="org-ul"><li><a id="sec-1-3-1" name="sec-1-3-1"></a>Method 1<br  /><div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">

<pre class="src src-sh">BUILDHOST$ make <span style="color: #eedd82;">ARCH</span>=arm ti8168_evm_defconfig
BUILDHOST$ make <span style="color: #eedd82;">ARCH</span>=arm zImage
Here we use 0x90008000 as the kernel load address and entry point
BUILDHOST$ mkimage -A arm -O linux -T kernel -C none -a 0x90008000 -e 0x90008000 -n <span style="color: #ffa07a;">'Linux-2.6.37'</span> -d arch/arm/boot/zImage uImage
</pre>
</div>
</div>
</li>
<li><a id="sec-1-3-2" name="sec-1-3-2"></a>Alternate Method: Single Step Build<br  /><div class="outline-text-4" id="text-1-3-2">
<div class="org-src-container">

<pre class="src src-sh">zreladdr-y=&lt;desired-load-address&gt; to make when building the uImage.
BUILDHOST$ make <span style="color: #eedd82;">ARCH</span>=arm zreladdr-y=0x90008000 uImage
</pre>
</div>
</div>
</li></ul>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">FAQ</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Build the kernel 2.6.38, but the name become "linux-2.6.38+". How can I prevent the + symbol from being prefixed to the kernel image name?</h3>
<div class="outline-text-3" id="text-2-1">
<p>
disable the plus sign is the LOCALVERSION environment variable or make variable:
</p>
<div class="org-src-container">

<pre class="src src-sh">make <span style="color: #eedd82;">LOCALVERSION</span>= all
make <span style="color: #eedd82;">ARCH</span>=arm <span style="color: #eedd82;">CROSS_COMPILE</span>=arm-angstrom-linux-gnueabi- <span style="color: #eedd82;">LOCALVERSION</span>= -j6 uImage
</pre>
</div>

<p>
More:
</p>

<p>
<code>/scripts/setlocalversion</code> is the culprit. Read at the bottom of the file under
which conditions it adds the +.
</p>

<p>
kbuild will append '+' if you modify the source code unless you
provide <code>LOCALVERSION=</code>.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2014-10-29 Wed 22:50</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
